## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

+       node_config {
+           disk_size_gb      = 10
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "n2d-standard-2"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam-tf@terrateam-cinema.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = []

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       node_pool {
+           initial_node_count          = 2
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-d64b9aac-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-5db22699-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-d64b9aac-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroups/gke-cinema-core-5db22699-grp",
            ]
+           max_pods_per_node           = 65
+           name                        = "core"
+           node_count                  = 2
+           node_locations              = [
+               "us-central1-a",
+               "us-central1-b",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 8
+               min_node_count       = 2
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 10
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 1
+               machine_type      = "n2d-standard-2"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-cinema.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (17 unchanged blocks hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] has changed
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-cinema/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = false -> true
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/d5dfc2bda39f50c4b7dc667a8375790c7e604906" -> (known after apply)
!       name               = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/d5dfc2bda39f50c4b7dc667a8375790c7e604906" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJVHhwdEpRbEd3WUF3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJNall6TXpNM01qTXdNREEyTXprM05Ea3dNQ0FYRFRJeU1Ea3hPVEF5TVRnd01Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWXlOak16TXpjeU16QXdNRFl6T1RjME9UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRE52OWZ2SDFmcE1RSmJqdXFvRlpHaG1Kc2sKUURFbHNCdkhHcHJuN3o2Y043eDNhbkZnaHBVZjNOQkU5M1dKK0ltK09URDFFaWFsNTVUUTJWWGRYUDg1TC9uawpUZzdoWmk3NDh4ZVc0K1REcE5WOTJLSWtKVGxvNTgvYTBLMk5LZ1RuME52bWttc0F2RE9ESnczaFdXY0ZmNVAyCmRkaWh5WURUWklmMFVvejM3dTVhSnBjcjZveVBVMFYrc1dESExFUjQyY0YwUitMRm9hU3hNT2UvR2xJRFhJRDkKczF5TzJVZ0JhZW00eUQ4ck04UDNxOVdXK3djbW8vRjlmNGJ1VUpXVHhuVnVCRU94c0ZMK2M2dHk3M2hjN01mTgpTY1JIS0tud093aGtlellrblRqTmhYZktpZzltbkdvc2theE5acUhpSkVCbEdodUpzTE1mSUVva2Vxc1RBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRREpYcXZ3a3VtSTNHVjdjZFFaMU9MQQppQzFPRVlxUldqWk0wTHpwTFpOM0xjeTJLcUlnMFUydUNMZDhTM1pUdldpVHJRY01pL1NCZThXbTh4V1FSbGQvClhaVHlyQWFYN0hYanY0WEsvWVZYQ1pzR1BwVmpITkx6eUxpczEvS1poUzV5QzQ2bEhtREhYUTNId3FwUWoyQlgKTGJySkRDZmlPZEhXUXQzM2w5RDlKWFlrWGNHcmpRbHNFVjR0Sldwd1Ewb0RneTJWWXU4WW5xeEVJeG9ZaEJONApkekY4dVRoY1I2NXJkWnBpVEQ4OFpoeVAyOU95TDU3MWk5QUxOZ3NHbG1CZXY0VDlTM3JxczBWVWhqRm1hajU4CmRFWGlnejA2UjdrZ3p4d3VMdlZFem9iSUtBenNYeGlscDdhSmlrN3p2R3BBaTVPNUtLdlVZMW5NUURNZytHMG8KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-19T02:18:00Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_annotations.cinema will be created
+   resource "kubernetes_annotations" "cinema" {
+       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
+       api_version = "v1"
+       id          = (known after apply)
+       kind        = "Namespace"

+       metadata {
+           name = "asm-dataplane"
        }
    }

  # kubernetes_labels.default-istio will be created
+   resource "kubernetes_labels" "default-istio" {
+       api_version = "v1"
+       id          = (known after apply)
+       kind        = "Namespace"
+       labels      = {
+           "istio.io/rev" = "asm-managed-regular"
        }

+       metadata {
+           name = "istio-asm"
        }
    }

  # kubernetes_namespace.istio-gateway will be created
+   resource "kubernetes_namespace" "istio-gateway" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-gateway"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-cinema"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-cinema"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-cinema"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (19 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] will be updated in-place
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-cinema/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
